{
  "menu":[{
    "recipe": {
      "title": "Fresh octopus salad",
      "ingredients": [
            { "ingredient": "1kg octopus"},
            {"ingredient": "1 lemon, juice of"},
            {"ingredient": "4 tbsp of extra virgin olive oil"},
            {"ingredient": "1 red onion, thinly sliced"},
            {"ingredient": "2 red chillies, chopped"},
            {"ingredient": "1 white onion, cut into quarters"},
            {"ingredient": "1 bay leaf"},
            {"ingredient": "1 tsp salt"},
            {"ingredient": "1 tsp black pepper"},
            {"ingredient": "fresh coriander, to garnish"}
        ],
        "smallImage": "01S",
        "largeImage": "01L",
        "description": [
            {"step": "Clean and section the octopus (or get your fishmonger to do it for you) and wash it well"},
            {"step": "Place the octopus into a pan with the bay leaf and onion. Cover with water and bring to a simmer. Simmer for around 45 minutes until tender. Check this by inserting a fork or toothpick into the thickest part of the flesh. If its tender and soft it's cooked to perfection."},
            {"step": "Meanwhile make the dressing: mix together the olive oil, lemon juice, chillies, salt and pepper"},
            {"step": "Once cooked, let the octopus cool in the liquor. When cool drain and reserve the onion from the water. Slice the octopus into 1cm pieces."},
            {"step": "Toss the octopus and onion with the dressing and serve"}
        ],
        "dificulty": "medium",
        "cookingTime": "45 minutes",
        "info": "Have you ever cooked octopus? Selina gives some great tips on dealing with this eight legged creature and shares a beautiful recipe for fresh octopus salad.",
        "author": "Jian-Yang",
        "authorDescription": "Jìan-Yáng is a shady app developer living in Erlich Bachman's Hacker Hostel and business incubator, Aviato.",
        "authorImage": "Jian-Yang"
        }
    },
      {
        "recipe": {
          "title": "Grilled octopus with fennel, caramelised lemon and salsa cruda",
          "ingredients": [
                { "ingredient": "1 small octopus, defrosted if frozen"},
                {"ingredient": "1 fennel, large, quartered and root trimmed"},
                {"ingredient": "olive oil, for cooking"},
                {"ingredient": "1 tsp fennel seeds"},
                {"ingredient": "150ml of moscatel vinegar"},
                {"ingredient": "1 banana shallot, large, finely chopped"},
                {"ingredient": "1/2 bunch of flat-leaf parsley, finely chopped"},
                {"ingredient": "1/2 bunch of dill, finely chopped"},
                {"ingredient": "50ml of extra virgin olive oil"},
                {"ingredient": "1 lemon, topped and tailed, cut into 4 equal circles"},
                {"ingredient": "sea salt"},
                {"ingredient": "freshly ground black pepper"}
            ],
            "smallImage": "02S",
            "largeImage": "02L",
            "description": [
                {"step": "Steam or simmer the octopus for 45-60 minutes, until very tender, then set aside"},
                {"step": "Preheat an oven to 170°C/Gas mark 3.5"},
                {"step": "Place the fennel on a baking tray, drizzle with olive oil and sprinkle over the fennel seeds. Pour over 50ml of the vinegar, season with salt and pepper then cook in the oven until tender and just starting to crisp at the ends (around 30-45 minutes)"},
                {"step": "Meanwhile, cut the tentacles from the head of the octopus and reserve the head for another dish"},
                {"step": "Place a griddle pan over a medium-high heat or light a barbecue and wait for the coals to begin glowing"},
                {"step": "Make the salsa cruda by combining the shallot, herbs, extra virgin olive oil and the remaining vinegar. Season to taste and set aside"},
                {"step": "Place the lemon circles on the griddle pan or barbecue and cook for a few minutes on each side, until charred and softened. Set aside"},
                {"step": "Rub the tentacles with olive oil and season, then place on the griddle or barbecue and cook for 2-3 minutes until lightly charred and crisp"},
                {"step": "To serve, place a lemon wedge, a fennel quarter and 1 or 2 octopus tentacles on each plate. Finish with a spoonful of the salsa cruda"}
            ],
            "dificulty": "easy",
            "cookingTime": "2 hours",
            "info": "If you haven't had octopus before, we can't think of a better dish to introduce you to its delicious flavour and meaty texture. The tentacles are grilled until crisp and lightly charred, served with the fresh anise hit of fennel and dressed with a simple combination of shallots and herbs in oil and vinegar. The caramelised lemon wedge finishes things off with a smoky sweetness.",
            "author": "Jian-Yang",
            "authorDescription": "Jìan-Yáng is a shady app developer living in Erlich Bachman's Hacker Hostel and business incubator, Aviato.",
            "authorImage": "Jian-Yang"
            }
        },
      {
        "recipe": {
          "title": "Fried Octopus With Garlic",
          "ingredients": [
                {"ingredient": "1 bunch of leeks (garlic sprouts)"},
                {"ingredient": "1 chili peppers (red pepper, fresh chili peppers will be better"},
                {"ingredient": "6 slices of ginger"},
                {"ingredient": "500 g octopus"},
                {"ingredient": "1 tablespoon salt (wash octopus)"},
                {"ingredient": "1 teaspoon white vinegar (blanch octopus)"},
                {"ingredient": "1/4 teaspoon light soy sauce"},
                {"ingredient": "1/4 teaspoon oyster sauce"},
                {"ingredient": "1/2 teaspoon white vinegar"},
                {"ingredient": "1/8 teaspoon salt"}
            ],
            "smallImage": "03L",
            "largeImage": "03L",
            "description": [
                {"step": "Firstly, we should prepare ingredients for this food. Cut 1 bunch of garlic sprouts, save them for later. Then cut 1 red pepper, save it for later. Cut 6 slices of ginger. Then shred 3 slices of ginger, save them for later."},
                {"step": "Second, we should wash octopus for this food. Firstly, we should turn the head of the octopus out. Then remove the viscera. If it still has teeth, we should aslo remove them. After that, add 1 tablespoon salt to scrub the octopus. It can help us to clean the mucus from the octopus. Then use the water to wash them twice. Save them for later."},
                {"step": "Next, we should cut octopus. Firstly, separate the head and the feet. Then cut the head into 2 pieces. After that, according to the side of the 8 feet of octopus, cut it into 4 pieces. Then save them for later."},
                {"step": "Next, we should blanch octopus. Firstly, add 3 slices of ginger, 1 teaspoon white vinegar into the pan. Then add enough water into the pan. Use the big fire to boil them. After the water has boiled, add the octopus into the pan and blanch them for 30 seconds. Then put them into the cold water to wash. Then save them for later."},
                {"step": "Now we can start to fry Chinese octopus with garlic. Firstly, add 1 tablespoon peanut oil into the pan. Use the big fire to heat it. Then add the shredded ginger, stir fry until fragrant. Then add octopus into the pan. Stir fry it for 2 minutes. Then add 1/4 teaspoon light soy sauce, 1/4 teaspoon oyster sauce, 1/2 teaspoon white vinegar, 1/8 teaspoon salt into the pan. Stir them evenly. Then add the garlic sprouts and red pepper into the pan. Stir fry until the garlic sprouts are tender. Then we got the delicious Chinese stir fry octopus."}
            ],
            "dificulty": "easy",
            "cookingTime": "10 mins",
            "info": "This Chinese octopus recipe is very easy for you. It only takes 15 minutes to do it. You can use our octopus recipe to make a good dish for your family.",
            "author": "Jian-Yang",
            "authorDescription": "Jìan-Yáng is a shady app developer living in Erlich Bachman's Hacker Hostel and business incubator, Aviato.",
            "authorImage": "Jian-Yang"
            }
        },
      {
        "recipe": {
          "title": "Boiled Fresh Octopus",
          "ingredients": [
                {"ingredient": "1 octopus, very fresh"},
                {"ingredient": "1 tbsp soy sauce"},
                {"ingredient": "1/4 tsp wasabi"}
            ],
            "smallImage": "04L",
            "largeImage": "04L",
            "description": [
                {"step": "Separate the head from the tentacles if your fish guy hasn't done it yet.  Remove the eyes, teeth, cartilage spine and whatever else that is in the octopus head.  Rinse your octopus in running water for a minute.  DO NOT cut up the octopus now.  Cook first and slice it up later."},
                {"step": "In a large pot, heat enough water to cover the octopus by an inch or so.  When the water boils add the octopus.  When the water reboils, cover and cook 5-15 minutes according to your preference."},
                {"step": "Remove from water immediately and let cool completely.  Slice tentacles at an angle into 1/4 thick slices and the head meat into neat strips with a good sharp sashimi knife (if you have one.)"},
                {"step": "Arrange nicely on plate and serve with a dip of your best soy sauce with a dash of wasabi!"}
            ],
            "dificulty": "easy",
            "cookingTime": "5 mins",
            "info": "Boiled Fresh Octopus served simply with a soy sauce and wasabi dip.  So fresh and yummilicious!",
            "author": "Jian-Yang",
            "authorDescription": "Jìan-Yáng is a shady app developer living in Erlich Bachman's Hacker Hostel and business incubator, Aviato.",
            "authorImage": "Jian-Yang"
            }
        },
      {
        "recipe": {
          "title": "Spicy stir-fried octopus (nakji bookeum)",
          "ingredients": [
                {"ingredient": "300 g (10½ oz) baby octopus (about 10–12)"},
                {"ingredient": "salt"},
                {"ingredient": "vegetable oil"},
                {"ingredient": "½ onion, thinly sliced"},
                {"ingredient": "2 spring onions (scallions), cut into 5-cm (2-in) lengths, plus extra thinly"},
                {"ingredient": "sliced onions, to garnish"},
                {"ingredient": "toasted sesame seeds, to garnish"}
            ],
            "smallImage": "05L",
            "largeImage": "05L",
            "description": [
                {"step": "To clean the octopus, make a cut between the head and the tentacles. Turn the head inside out and clean out all the innards. For the tentacles, cut them in half then trim off the eyes and the beak. Put them in a bowl, add the salt, then use your hands to rub the octopus for 2–3 minutes to clean the suction cups. Once tiny bubbles form on the suction cups, rinse the octopus under cold water two or three times, then drain and set aside."},
                {"step": "To make the marinade, combine all the ingredients in a bowl and mix until the sugar has dissolved. Add the marinade to the octopus and stir until the octopus is well coated. Set aside to marinate for 10 minutes."},
                {"step": "Heat the vegetable oil in a frying pan or wok over medium–high heat. Stir-fry the onion for 2 minutes or until soft and translucent. Add the marinated octopus, scraping all the marinade from the bowl into the pan. Stir-fry for another 3 minutes or until the octopus is just cooked through. Add the spring onion, stir-fry for another 30 seconds, then remove from the heat and transfer to a serving bowl. Garnish with sesame seeds and extra spring onion and serve immediately with steamed rice."}
            ],
            "dificulty": "medium",
            "cookingTime": "5 mins",
            "info": "The baby octopus in this recipe is perfectly cooked in a gochujang hot sauce. This dish is very spicy, a perfect winter treat for those who like it hot.",
            "author": "Jian-Yang",
            "authorDescription": "Jìan-Yáng is a shady app developer living in Erlich Bachman's Hacker Hostel and business incubator, Aviato.",
            "authorImage": "Jian-Yang"
            }
        },
      {
        "recipe": {
          "title": "Spicy Stir Fried Octopus w/ Vegetables",
          "ingredients": [
                {"ingredient": "1 lb octopus (squid can be used as a substitute)"},
                {"ingredient": "1 cup onion, diced"},
                {"ingredient": "2 chilies or jalapenos, sliced on the bias"},
                {"ingredient": "2 green onions, sliced on the bias"},
                {"ingredient": "1 cup zucchini strips "},
                {"ingredient": "1/2 cup carrots thin strips"},
                {"ingredient": "1 red or green peppers, sliced in long strips"}
            ],
            "smallImage": "06L",
            "largeImage": "06L",
            "description": [
                {"step": "Wash and rinse octopus, cut the legs into 2-3 lengths, open head and take out inside, quarter the head. Drain well."},
                {"step": "Prepare and mix all ingredients for sauce"},
                {"step": "Combine final sauce with octopus and marinate for 10 minutes."},
                {"step": "Heat pan on a medium high heat, cook for 8-10 minutes or until done."}
            ],
            "dificulty": "medium",
            "cookingTime": "10 mins",
            "info": "Nakji Bokum is a very spicy octopus dish enjoyed by many Koreans. Different variation of this dish do exist as the octopus can be substituted with squid for less chewy texture and taste. Some may find this dish too spicy even diluted with rice that accompanies this dish.",
            "author": "Jian-Yang",
            "authorDescription": "Jìan-Yáng is a shady app developer living in Erlich Bachman's Hacker Hostel and business incubator, Aviato.",
            "authorImage": "Jian-Yang"
            }
        },
      {
        "recipe": {
          "title": "Chinese Celery and Baby Octopus, the Vietnamese way",
          "ingredients": [
                {"ingredient": "1 pound baby octopus, cleaned"},
                {"ingredient": "1 bunch Chinese celery"},
                {"ingredient": "2 tomatoes, sliced"},
                {"ingredient": "3 tablespoons fish sauce, or to taste"},
                {"ingredient": "3 tablespoons sriracha"},
                {"ingredient": "Juice of half a lemon"},
                {"ingredient": "1 onion"}
            ],
            "smallImage": "07L",
            "largeImage": "07L",
            "description": [
                {"step": "Marinade the octopus in sriracha, fish sauce and juice of half a lemon for 15-20 minutes. In the meantime wash and cut the long Chinese celery into thirds or quarters (length-wise)."},
                {"step": "In a large saute pan, saute the onion until soft , then add the celery and saute for 5 minutes until soft but still a bit crunchy. Add the baby octopus and its marinade and stir quickly, saute only until just cooked (the meat will be pokeable with a chopstick, not transparent, not too soft)."},
                {"step": "Push the octopus to the outside rim of your pan where it's less hot, or you can even REMOVE the octopus from the pan. Add the tomatoes last for another 3-5 minutes until just cooked. If you have a really really large pan, you can put in the octopus and tomatoes together at the same time. Serve and enjoy!"}
            ],
            "dificulty": "medium",
            "cookingTime": "25 mins",
            "info": "This is a classic preparation in Vietnam, except usually we make it with squid. The baby octopus just looked really good at the market that time, so we thought - why not? With squid, you would slice it thin or score criss-cross on a 2x2'' piece of squid, to make it cook fast without getting chewy, and absorb the sauce. I took a chance with baby octopus and saute it really fast, and then cut it up when we eat.",
            "author": "Jian-Yang",
            "authorDescription": "Jìan-Yáng is a shady app developer living in Erlich Bachman's Hacker Hostel and business incubator, Aviato.",
            "authorImage": "Jian-Yang"
            }
        },
      {
        "recipe": {
          "title": "Cooked Octopus Recipe",
          "ingredients": [
                {"ingredient": "2 to 3 pounds octopus, fresh or frozen"},
                {"ingredient": "3 to 5 quarts cold water"}
            ],
            "smallImage": "08L",
            "largeImage": "08L",
            "description": [
                {"step": "Gather the ingredients."},
                {"step": "If buying fresh octopus, ask the fishmonger to clean it for you. However, if the octopus is not pre-cleaned, wash and clean it, removing the ink sac and internal organs by making a circular cut around the beak, with a paring knife. Pull away the beak and the organs will come with it. All frozen octopus is pre-cleaned."},
                {"step": "Set the octopus in a large pot with enough water to cover it, then bring the water to just a simmer."},
                {"step": "Simmer very gently at 190 to 200 F. Timing varies depending on the weight of the octopus and how many you are cooking. For a 2- to 3-pound octopus, it will usually be between 1 to 2 hours. Test for doneness by inserting a knife where the head meets the legs. The knife should slide in easily. If not, allow more time to cook. Once the octopus is tender, use it in your favorite recipe. Grill it or slice it in a salad. Enjoy."}
            ],
            "dificulty": "medium",
            "cookingTime": "2 hours",
            "info": "Octopus is a beast to prepare not because it's hard, but because there is a lot of conflicting information as to what's best to do. Always a delightful dish when properly cooked, and a disaster when served chewy and rubbery, octopus needs some time investment to really shine. ",
            "author": "Jian-Yang",
            "authorDescription": "Jìan-Yáng is a shady app developer living in Erlich Bachman's Hacker Hostel and business incubator, Aviato.",
            "authorImage": "Jian-Yang"
            }
        }
    ]
  }
